---
kind: property
id: P:Autodesk.Revit.DB.InternalDefinition.Name
source: html/243ae611-586c-786b-501e-a718073d32b7.htm
---
# Autodesk.Revit.DB.InternalDefinition.Name Property

The user-visible name for the parameter.

## Syntax (C#)
```csharp
public override string Name { get; }
```